 <->
 <->  You need to modify this job
 <->
 <->    Note:  written in upper/lower case:
 <->             = type JCL in upper case before submitting
 <->             = OR enter edit command: CAPS ON and then modify JCL
 <->                                      -------
 <->
 <->    1) add job card
 <->
 <->    2) update SET stmt THISDSN to dataset/pds to the name of
 <->      this pds (on your system) that you are editing
 <->      this member in.
 <->
 <->    3) update SET stmt XREFHLQ to create new pds's under this
 <->      high level qualifier(s).  The pds's created will be:
 <->         DSN=&XREFHLQ..DOC
 <->         DSN=&XREFHLQ..JCL
 <->         DSN=&XREFHLQ..REXX
 <->         DSN=&XREFHLQ..SAMPLE.SCAN
 <->         DSN=&XREFHLQ..SAMPLE.XREF
 <->
 <->    4) review/update SET stmt RECOPT for your installation
 <->
 <->    5) delete these comment (before job card)
 <->
 <->    6) submit $EXPAND
 <->
 <->
//  job ... --- add your job card here
//*
//* Job to use XMI* members in this pds, to create other pds's
//*
//*
//   EXPORT SYMLIST=(THISDSN,XREFHLQ,RECOPT)
//*    use fully qualified dataset names (below)
//*    -----------------------------------------
//   SET THISDSN='dataset.name.here' <---update value to DSN
//*                                     you are running this job
//*                                     from.
//   SET XREFHLQ='hlq1.hlq2.etc'     <---update for creating
//*                                     new pds's with this hlq.
//   SET RECOPT='UNIT(SYSDA)'  <---receive options (this is minimum)
//*                                although you may use a different
//*                                unit_name and/or add more options
//*     potential RECOPT options:
//*     -------------------------
//*        UNIT(unit_name)
//*        VOLUME(volser)
//*        SPACE(primary,sec)
//*        TRACKS or CYLINDERS
//*        DIRECTORY(blocks)
//*        BLKSIZE(size)
//*        NEW or OLD or MOD or SHR
//*        MGMTCLAS(management_class_name)
//*        STORCLAS(storage_class_name)
//*
//*
//*
//PACKAGE  EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSEXEC  DD  DISP=SHR,DSN=SFRH66.PUBLIC.REXXXREF.REXX
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//*
//*//XMIDOC   DD  DISP=SHR,DSN=&THISDSN.(XMIDOC)
//*//XMIJCL   DD  DISP=SHR,DSN=&THISDSN.(XMIJCL)
//*//XMIREXX  DD  DISP=SHR,DSN=&THISDSN.(XMIREXX)
//*//XMISCAN  DD  DISP=SHR,DSN=&THISDSN.(XMISCAN)
//*//XMIXREF  DD  DISP=SHR,DSN=&THISDSN.(XMIXREF)
//*
//SYSTSIN  DD  *,SYMBOLS=JCLONLY create PDS's for rexx xref
PROFILE NOPREFIX
TSOEXEC RECEIVE INDSNAME(&THISDSN.(XMIDOC))
  DATASET(&XREFHLQ..DOC) &RECOPT
TSOEXEC RECEIVE INDSNAME(&THISDSN.(XMIJCL))
  DATASET(&XREFHLQ..JCL) &RECOPT
TSOEXEC RECEIVE INDSNAME(&THISDSN.(XMIREXX))
  DATASET(&XREFHLQ..REXX) &RECOPT
TSOEXEC RECEIVE INDSNAME(&THISDSN.(XMISCAN))
  DATASET(&XREFHLQ..SAMPLE.SCAN) &RECOPT
TSOEXEC RECEIVE INDSNAME(&THISDSN.(XMIXREF))
  DATASET(&XREFHLQ..SAMPLE.XREF) &RECOPT
